#+Title: fzlbpms
#+SEQ_TODO: todo(d) maybe(m) onwork(o)

This is a project with BPMS in mind

BPMS is a environment where you design some kind of diagram like BPMN
or a some graph or other that represent a design of workflow that can
be instantiated.

The workflow represent, in general, a business process or just a
sequence of steps of web services or code to be processed.

With this mindset, this project is a set of containers and softwares
tools to acomplish this task



* Usage in develpment

1) install: git, docker and docker compose tools nodejs npm 

2) clone the fzlbmps repo

I'm on a debian 13 virtual machine... so I've cloned the fzlbpms with
this command below...

mkdir -p  $HOME/mvn/kvm_share/

cd $HOME/mvn/kvm_share/

git clone https://github.com/wagnermarques/fzlbpms.git

cd fzlbpms

3) starts the containers nginx, php8.3-fpm and postgresql

   docker compose up --build fzl-nginx fzl-php8.3-fpm fzl-postgresql

4) acessing the php test page from nginx and php8.3
   
accessing in the browser:

http://localhost




http://localhost/teste/


5) Starts the admin gui

Admin Gui is a tauri (like Electron) desktop application, somethink
like vscode arquitecture. It is a tauri that shows angular with a rust
backend process.

so install rust. Here we are using debian 13

#+name: 
#+begin_src shell
sudo apt update
sudo apt install curl build-essential
curl --proto '=https' --tlsv1.2 -sSf https://sh.rustup.rs | sh
source $HOME/.cargo/env
rustc --version
cargo --version
#+end_src

Now, starts the admingui app

#+name: 
#+begin_src shell
   wgn@debian:~/mvn/kvm_share/fzlbpms$ pwd
  /home/wgn/mvn/kvm_share/fzlbpms
  wgn@debian:~/mvn/kvm_share/fzlbpms$ cd src-projects/
  fzlbpmsadmin/  karaf_bundles/ karaf_sources/ mvn-artifacts/ var_www/       
  wgn@debian:~/mvn/kvm_share/fzlbpms$ cd src-projects/fzlbpmsadmin/
  angular-ui/ gen/        icons/      src/        
  wgn@debian:~/mvn/kvm_share/fzlbpms$ cd src-projects/fzlbpmsadmin/angular-ui/
  .gemini/ public/  src/     
  wgn@debian:~/mvn/kvm_share/fzlbpms$ cd src-projects/fzlbpmsadmin/angular-ui/
  wgn@debian:~/mvn/kvm_share/fzlbpms/src-projects/fzlbpmsadmin/angular-ui$ npm install
  wgn@debian:~/mvn/kvm_share/fzlbpms/src-projects/fzlbpmsadmin/angular-ui$ npm run tauri:dev

#+end_src



* Dashboard
** containers
*** the stack
#+name: the stack
#+begin_src shell :session s1 :exports both :results output
docker compose ps
#+end_src

#+RESULTS: the stack
#+begin_example
NAME                          IMAGE                                 COMMAND                  SERVICE                       CREATED          STATUS                      PORTS
fzl-elasticsearch             fzlbpms-fzl-elasticsearch             "/bin/tini -- /usr/l…"   fzl-elasticsearch             11 minutes ago   Up 11 minutes (unhealthy)   0.0.0.0:9200->9200/tcp, [::]:9200->9200/tcp, 9300/tcp
fzl-fakemail                  gessnerfl/fake-smtp-server:latest     "java -Djava.securit…"   fzl-fakemail                  11 minutes ago   Up 11 minutes               
fzl-karaf-camel-integration   fzlbpms-fzl-karaf-camel-integration   "entrypoint.sh /opt/…"   fzl-karaf-camel-integration   11 minutes ago   Up 11 minutes               1099/tcp, 8101/tcp, 8181/tcp, 44444/tcp
fzl-kibana                    fzlbpms-fzl-kibana                    "/bin/tini -- /usr/l…"   fzl-kibana                    11 minutes ago   Up 11 minutes               0.0.0.0:5601->5601/tcp, [::]:5601->5601/tcp
fzl-mongodb                   mongo:4.4                             "docker-entrypoint.s…"   fzl-mongodb                   11 minutes ago   Up 11 minutes (healthy)     27017/tcp
fzl-mysql                     mysql:8.0                             "docker-entrypoint.s…"   fzl-mysql                     11 minutes ago   Up 11 minutes               33060/tcp, 0.0.0.0:3316->3306/tcp, [::]:3316->3306/tcp
fzl-nexus                     fzlbpms-fzl-nexus                     "/opt/sonatype/nexus…"   fzl-nexus                     11 minutes ago   Up 11 minutes (unhealthy)   0.0.0.0:8082->8082/tcp, [::]:8082->8082/tcp, 0.0.0.0:8088->8081/tcp, [::]:8088->8081/tcp
fzl-nginx                     fzlbpms-fzl-nginx                     "/docker-entrypoint.…"   fzl-nginx                     11 minutes ago   Up 11 minutes               0.0.0.0:80->80/tcp, [::]:80->80/tcp, 0.0.0.0:8899-8900->8899-8900/tcp, [::]:8899-8900->8899-8900/tcp
fzl-php8.1-fpm                fzlbpms-fzl-php8.1-fpm                "docker-php-entrypoi…"   fzl-php8.1-fpm                11 minutes ago   Up 11 minutes               9000/tcp
fzl-php8.3-fpm                fzlbpms-fzl-php8.3-fpm                "docker-entrypoint.s…"   fzl-php8.3-fpm                11 minutes ago   Up 11 minutes               9000/tcp
fzl-phpmyadmin                phpmyadmin/phpmyadmin                 "/docker-entrypoint.…"   fzl-phpmgyadmin               11 minutes ago   Up 11 minutes               0.0.0.0:8889->80/tcp, [::]:8889->80/tcp
fzl-portainer                 portainer/portainer-ce:latest         "/portainer"             fzl-portainer                 13 days ago      Up 20 minutes               0.0.0.0:9000->9000/tcp, [::]:9000->9000/tcp, 8000/tcp, 9443/tcp, 0.0.0.0:9043->9043/tcp, [::]:9043->9043/tcp
fzl-postgresql                fzlbpms-fzl-postgresql                "docker-entrypoint.s…"   fzl-postgresql                11 minutes ago   Up 11 minutes (healthy)     0.0.0.0:5432->5432/tcp, [::]:5432->5432/tcp
fzl-redis                     redis:7-alpine                        "docker-entrypoint.s…"   fzl-redis                     11 minutes ago   Up 11 minutes (healthy)     6379/tcp
#+end_example

fzl-elasticsearch           
fzl-fakemail                
fzl-karaf-camel-integration 
fzl-kibana                  
fzl-mongodb                 
fzl-mysql                   
fzl-nexus                   
fzl-nginx                   
fzl-php8.1-fpm              
fzl-php8.3-fpm              
fzl-phpmyadmin              
fzl-portainer               
fzl-postgresql              
fzl-redis                   


*** fzl-portainer
http://localhost:9000/

*** fzl-nginx

*** fzl-nexus

*** fzl-mysql

*** fzl-fakemail

*** fzl-kibana

*** fzl-phpmyadmin

*** fzl-overleaf

*** fzl-php8.3-fpm

*** fzl-php8.1-fpm

*** fzl-mongodb

*** fzl-postgresql

*** fzl-karaf-camel-integration

*** fzl-elasticsearch

*** fzl-redis


** aplicacoes disponiveis - ambiente dev
*** http://localhost/ava211
admin s3cret

*** http://localhost:8900/moodle


*** http://localhost:8899/karafconsole soon, not so



** karaf
*** acesso via console
firefox http://localhost:8181/system/console

*** ver logs



** [[http://localhost:8081][nexus]]
http://localhost:8081/

*** Documentacao
https://help.sonatype.com/en/repository-manager-concepts.html

https://my.sonatype.com/



* instalation



* apps installations
** moodle
** yii2 apps


* TASKS
**  redefine moodle admin user

#+name: ./bin/moodle/reset-password.sh
#+begin_src shell
  echo $(pwd)
  ./bin/moodle/reset-password.sh
#+end_src

#+RESULTS: ./bin/moodle/reset-password.sh
| /run/media/wgn/ext4/Projects-Srcs/fzlbpms |        |      |     |                |     |                                                   |                      |                   |
| Running...                                | docker | exec | -it | fzl-php8.3-fpm | php | /var/www/html/moodle/admin/cli/reset_password.php | --username=useradmin | --password=s3cret |






* emacs anots
** tasks notes
C-c C-d on #+SEQ_TODO: todo(d) maybe(m) onwork(o)


